<a href="https://colab.research.google.com/github/HiralJain112/Python_notebooks/blob/main/Data_analysis_using_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Salaries dataset**

In [2]:
import pandas as pd

In [3]:
sal = pd.read_csv('Salaries.csv')

In [4]:
sal.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [5]:
sal.head(2)

   Id    EmployeeName  ...         Agency  Status
0   1  NATHANIEL FORD  ...  San Francisco     NaN
1   2    GARY JIMENEZ  ...  San Francisco     NaN

[2 rows x 13 columns]

In [6]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [7]:
sal['BasePay'].mean()

66325.44884050643

In [8]:
sal['OvertimePay'].max()

245131.88

In [10]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [11]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']

    Id     EmployeeName  ...         Agency  Status
24  25  JOSEPH DRISCOLL  ...  San Francisco     NaN

[1 rows x 13 columns]

In [13]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [20]:
#Employees name with max total pay benefits
sal[sal['TotalPayBenefits'].max() == sal['TotalPayBenefits']]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

#name of lowest paid employee including benefits

In [23]:
#name of lowest paid employee including benefits
sal[sal['TotalPayBenefits'].min() == sal['TotalPayBenefits']]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

#average (mean) BasePay of all employees per year ?(2011-2014)

In [24]:
#average (mean) BasePay of all employees per year ?(2011-2014)
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

## Unique Job titles

In [25]:
sal['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

##No. of Unique Job Titles

In [26]:
sal['JobTitle'].nunique()

2159

In [27]:
len(sal['JobTitle'].unique())

2159

##Top 5 most common jobs

In [29]:
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

##How many Job Titles were represented by only one person in 2013? (e.g. job titles with only one occurence in 2013?)

In [31]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1)

202

##How many people have the word Chief in their job title?

In [36]:
#sal['JobTitle']
def chief_string(title):
  if 'chief' in title.lower().split():
    return True
  else:
    return False

In [37]:
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

477

##Check if there is any correlation between length of the job title string and Salary

In [39]:
sal['job_title_len'] = sal['JobTitle'].apply(len)

In [40]:
sal[['JobTitle','job_title_len']]

                                              JobTitle  job_title_len
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY             46
1                      CAPTAIN III (POLICE DEPARTMENT)             31
2                      CAPTAIN III (POLICE DEPARTMENT)             31
3                 WIRE ROPE CABLE MAINTENANCE MECHANIC             36
4         DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)             44
...                                                ...            ...
148649                                       Custodian              9
148650                                    Not provided             12
148651                                    Not provided             12
148652                                    Not provided             12
148653                      Counselor, Log Cabin Ranch             26

[148654 rows x 2 columns]

In [42]:
sal[['job_title_len','TotalPayBenefits']].corr()

                  job_title_len  TotalPayBenefits
job_title_len          1.000000         -0.036878
TotalPayBenefits      -0.036878          1.000000